Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
image_input (InputLayer)         (None, 224, 224, 3)   0                                            
____________________________________________________________________________________________________
vgg19 (Model)                    multiple              20024384    image_input[0][0]                
____________________________________________________________________________________________________
bottlekneck_1_1_conv_1 (Convolut (None, 7, 7, 128)     65664       vgg19[1][0]                      
____________________________________________________________________________________________________
batch_norm_1 (BatchNormalization (None, 7, 7, 128)     512         bottlekneck_1_1_conv_1[0][0]     
____________________________________________________________________________________________________
bottlekneck_1_1_conv_2 (Convolut (None, 7, 7, 32)      4128        batch_norm_1[0][0]               
____________________________________________________________________________________________________
batch_norm_2 (BatchNormalization (None, 7, 7, 32)      128         bottlekneck_1_1_conv_2[0][0]     
____________________________________________________________________________________________________
flatten (Flatten)                (None, 1568)          0           batch_norm_2[0][0]               
____________________________________________________________________________________________________
dropout (Dropout)                (None, 1568)          0           flatten[0][0]                    
____________________________________________________________________________________________________
predictions (Dense)              (None, 10)            15690       dropout[0][0]                    
====================================================================================================
Total params: 20,110,506
