Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, None, None, 3) 0                                            
____________________________________________________________________________________________________
block1_conv1 (Convolution2D)     (None, None, None, 64 1792        input_1[0][0]                    
____________________________________________________________________________________________________
block1_conv2 (Convolution2D)     (None, None, None, 64 36928       block1_conv1[0][0]               
____________________________________________________________________________________________________
block1_pool (MaxPooling2D)       (None, None, None, 64 0           block1_conv2[0][0]               
____________________________________________________________________________________________________
block2_conv1 (Convolution2D)     (None, None, None, 12 73856       block1_pool[0][0]                
____________________________________________________________________________________________________
block2_conv2 (Convolution2D)     (None, None, None, 12 147584      block2_conv1[0][0]               
____________________________________________________________________________________________________
block2_pool (MaxPooling2D)       (None, None, None, 12 0           block2_conv2[0][0]               
____________________________________________________________________________________________________
block3_conv1 (Convolution2D)     (None, None, None, 25 295168      block2_pool[0][0]                
____________________________________________________________________________________________________
block3_conv2 (Convolution2D)     (None, None, None, 25 590080      block3_conv1[0][0]               
____________________________________________________________________________________________________
block3_conv3 (Convolution2D)     (None, None, None, 25 590080      block3_conv2[0][0]               
____________________________________________________________________________________________________
block3_conv4 (Convolution2D)     (None, None, None, 25 590080      block3_conv3[0][0]               
____________________________________________________________________________________________________
block3_pool (MaxPooling2D)       (None, None, None, 25 0           block3_conv4[0][0]               
____________________________________________________________________________________________________
block4_conv1 (Convolution2D)     (None, None, None, 51 1180160     block3_pool[0][0]                
____________________________________________________________________________________________________
block4_conv2 (Convolution2D)     (None, None, None, 51 2359808     block4_conv1[0][0]               
____________________________________________________________________________________________________
block4_conv3 (Convolution2D)     (None, None, None, 51 2359808     block4_conv2[0][0]               
____________________________________________________________________________________________________
block4_conv4 (Convolution2D)     (None, None, None, 51 2359808     block4_conv3[0][0]               
____________________________________________________________________________________________________
block4_pool (MaxPooling2D)       (None, None, None, 51 0           block4_conv4[0][0]               
____________________________________________________________________________________________________
block5_conv1 (Convolution2D)     (None, None, None, 51 2359808     block4_pool[0][0]                
____________________________________________________________________________________________________
block5_conv2 (Convolution2D)     (None, None, None, 51 2359808     block5_conv1[0][0]               
____________________________________________________________________________________________________
block5_conv3 (Convolution2D)     (None, None, None, 51 2359808     block5_conv2[0][0]               
____________________________________________________________________________________________________
block5_conv4 (Convolution2D)     (None, None, None, 51 2359808     block5_conv3[0][0]               
____________________________________________________________________________________________________
block5_pool (MaxPooling2D)       (None, None, None, 51 0           block5_conv4[0][0]               
====================================================================================================
Total params: 20,024,384
